#include "delay.h"


/*******************************************
**	函数：Delay_us
**	功能：微秒级延时函数
**	参数：无
**	返回：无
**  说明：27.0000MHz
********************************************/
void Delay_us(u16 x)
{
	u8 i;
	do
	{
		i = 6;
		while (--i);
	}while(--x);
}

/*******************************************
**	函数：Delay_ms
**	功能：毫秒级延时函数
**	参数：无
**	返回：无
**  说明：27.0000MHz
********************************************/
void Delay_ms(u16 x)
{
	u8 i, j;
	do
	{
		//_nop_();
		_nop_();
		i = 36;
		j = 13;
		do
		{
			while (--j);
		} while (--i);
	}while(--x);
}


